{"Project-Management-Coursera/PM-Foundations/Key-Concepts":{"slug":"Project-Management-Coursera/PM-Foundations/Key-Concepts","filePath":"Project-Management-Coursera/PM Foundations/Key Concepts.md","title":"1. PM Foundations: Key Components","links":["Project-Management-Coursera/The-project-life-cycle","Project-Management-Coursera/PM-Foundations/Key-Concepts"],"tags":["pm"],"content":"Enabling Decision-Making\n\nFoster a collaborative decision-making process by involving team members in setting goals and achieving deliverables.\nEmpowering team members enhances responsibility, accountability, and team cohesion.\n\nCommunicating and Escalating\n\nClearly communicate project goals, roles, and expectations to ensure everyone is aligned.\nWhen issues arise, approach management with both the problem and potential solutions to demonstrate initiative.\n\nFlexibility\n\nAdaptability is crucial for project managers to navigate changes and challenges effectively.\nImplement flexible planning strategies, such as assessing external constraints and planning for risks, to manage unpredictability.\n\nHandling Ambiguity\n\nMaintain composure and express empathy to support your team during uncertain times.\nClearly communicate confirmed aspects of the project and make decisive choices to reduce uncertainty.\n\nKey Takeaway\n\nMastering flexibility and the ability to handle ambiguity, along with other core competencies, positions project managers for success in dynamic environments.\n\n\nRelated notes: The project life cycle Key Concepts"},"Project-Management-Coursera/PM-Foundations/PM-Methodologies":{"slug":"Project-Management-Coursera/PM-Foundations/PM-Methodologies","filePath":"Project-Management-Coursera/PM Foundations/PM Methodologies.md","title":"PM Methodologies","links":[],"tags":["pm"],"content":"Different program management methodologies\nGoogle PM guides\nLean six sigma\ncoggle.it/diagram/XdIfl65A3XR5G726/t/lean-six-sigma\nPM all about it\n PM overall mind map\nproject-scheduling-and-tracking\ncoggle.it/diagram/WGx7M5bCxOo_KASB/t/system-development-life-cycle-sdlc\nSystem-development-life-cycle-sdlc\nchangeManagement in PM\ndocs.google.com/presentation/d/1x0Lny6BVZsUqBKpsZ3PTus55NnBQzzRt/edit#slide=id.p9\n life cycle of a project.\nproject’s phases and each phase’s tasks."},"Project-Management-Coursera/Project-initiation/1.-Key-Components-of-Project-Initiation":{"slug":"Project-Management-Coursera/Project-initiation/1.-Key-Components-of-Project-Initiation","filePath":"Project-Management-Coursera/Project initiation/1. Key Components of Project Initiation.md","title":"1. Key Components of Project Initiation","links":[],"tags":["pm"],"content":"\nGoals: What you’re trying to achieve, often determined by senior leaders with your input.\nScope: Defining the work required to complete the project.\n\nDeliverables and Success Criteria\n\nDeliverables: Tangible or intangible products/services created for the client, contributing to project goals (e.g., a manuscript chapter, staff training).\nSuccess Criteria: Standards for measuring how well the project achieved its goals.\n\nStakeholders and Resources\n\nStakeholders: People interested in and affected by the project’s success, crucial for decision-making. They help determine goals, deliverables, and success criteria.\nResources: Budget, personnel, materials, and other items available for the project. Careful consideration of resources is vital for project completion. A project charter documents all the project details and is reviewed with stakeholders before moving to the planning phase.\n"},"Project-Management-Coursera/Project-initiation/2.-SMART-goals":{"slug":"Project-Management-Coursera/Project-initiation/2.-SMART-goals","filePath":"Project-Management-Coursera/Project initiation/2. SMART goals.md","title":"2. SMART goals","links":[],"tags":["pm"],"content":"Right goals for the right reasons\nSpecific, Measurable, Attainable, Relevant, and Time-bound.\nMain goal, several additional goals\nSpecific: what exactly i want to accomplish? Why? What context? Who is involved ? Who is this for?\nMeasurable: how do i know if the goal is accomplished? how you going to measure the result?  How alligned the measure system with the goal?\nAttainable:  right estimation of risks. How it can be accomplished?\nRelevant: ROI?"},"Project-Management-Coursera/Project-initiation/3.-OKR----objectives-and-key-results.":{"slug":"Project-Management-Coursera/Project-initiation/3.-OKR----objectives-and-key-results.","filePath":"Project-Management-Coursera/Project initiation/3. OKR -  objectives and key results..md","title":"3. OKR -  objectives and key results.","links":["Project"],"tags":["pm"],"content":"OKR\nOKR stands for objectives and key results.\nOKR invented by Andy Grove\nOKR is part of Project\nWithout OKR projects &amp; teams usually lack sense of purpose to inspire  teams!\ntransformational teams combine ambitions, passions and purpose.\nOKRs Defined\n\nOKRs combine a goal (objective) and a metric (key result) to determine a measurable outcome.\nObjectives define the desired outcome, while key results define when the objective has been met.\n\nUsing OKRs in Project Management\n\nOKRs help clarify project goals and deliverables, establish project scope, and motivate teams.\nProject-level OKRs support organizational goals and help teams prioritize tasks.\n\nCreating Effective OKRs\n\nObjectives should be aspirational, aligned with organizational goals, action-oriented, concrete, and significant.\nKey results should be time-bound, measurable, and challenging, indicating progress and defining objective achievement.\n\nOKR in Google\n**Objectives are the “Whats.”  Directions They:**\n- express goals and intents;\n- are aggressive yet realistic;\n- must be tangible, objective, and unambiguous; should be obvious to a rational observer whether an Objective has been achieved.\n- The successful achievement of an Objective must provide clear value for Google.\n\nObjectives:\n\n\nsignificant\n\n\naction oriented\n\n\ninspiring\npassion means when you transform it into action\n** Key Results are the “Hows.” They: **\n\nexpress measurable milestones which, if achieved, will advance Objective(s) in a useful manner to their constituents;\nmust describe outcomes, not activitie.\nDescribe the end-use impact of these activities: “publish average and tail latency measurements from six Colossus cells by March 7,” rather than “assess Colossus latency”;\nmust include evidence of completion. This evidence must be available, credible, and easily discoverable. Examples of evidence include change lists, links to docs, notes, and published metrics reports.\n\n\n\n** Key results: **\n\nSpecific and time bound\nAggressive and realistic\nMeasurable and verifiable\n\nIn google every quarter everyone writes OKR and publish it to collective commited.\nCommitted vs. aspirational OKRs\n-&gt; Commitments are OKRs that we agree will be achieved, and we will be willing to adjust schedules and resources to ensure that they are delivered.\n\n\n\n_The expected score for a committed OKR is 1.0; a score of less than 1.0 requires explanation for the miss, as it shows errors in planning and/or execution _\n→ By contrast, aspirational OKRs express how we’d like the world to look, even though we have no clear idea how to get there and/or the resources necessary to deliver the OKR.\n_- Aspirational OKRs have an expected average score of 0.7, with high variance. _\n\n\nOKR and smart-goals: the difference\nwww.whatmatters.com/resources/google-okr-playbook\nIBM OKR"},"Project-Management-Coursera/Project-initiation/4.-Project-scope":{"slug":"Project-Management-Coursera/Project-initiation/4.-Project-scope","filePath":"Project-Management-Coursera/Project initiation/4. Project scope.md","title":"4. Project scope","links":[],"tags":[],"content":"Understanding Project Scope\n\nProject scope outlines the boundaries of a project, detailing what is included and excluded.\nIt encompasses the project’s complexity, timeline, budget, and resources, ensuring clarity for all stakeholders.\n\nDetermining Project Scope\n\nEngage with sponsors and stakeholders to understand their goals and clarify what is not included in the project.\nKey questions to consider include the project’s origin, its necessity, expected achievements, and approval processes.\n\nDocumenting Project Scope\n\nDefining project scope should occur during the initial planning stage to align expectations and mitigate risks.\nDocumenting the scope allows for reference throughout the project life cycle, helping to manage changes effectively.\n\nIncludes Budget, timeline, resources.\nIf possible what could be added or removed while the project is progressing\nFlexibility\n\n\nHow much flexibility is there?\n\n\nWhat is the highest priority: hitting the deadline, sticking to the budget, or making sure the result meets all the quality targets?\n\n\nScope Creep\n\nScope creep refers to unexpected changes or additions that can impact project success.\nIt can arise from both external sources (like stakeholder requests) and internal sources (team member suggestions).\n\nManaging Scope Creep\n\nTo combat scope creep, ensure stakeholders have visibility into project details and set clear expectations.\nDocument agreements on change requests and maintain clarity on project requirements to minimize risks.\n"},"Project-Management-Coursera/Project-initiation/6-Sigma":{"slug":"Project-Management-Coursera/Project-initiation/6-Sigma","filePath":"Project-Management-Coursera/Project initiation/6 Sigma.md","title":"6 Sigma","links":[],"tags":["pm"],"content":"Six Sigma is a data-driven methodology used to improve processes by identifying and eliminating defects, reducing variation, and increasing quality and efficiency. It’s widely applied in manufacturing, engineering, healthcare, finance, and tech — and increasingly relevant in project management and process improvement roles.\n\n🎯 What Is Six Sigma?\n\n\nGoal: Reduce process variation and defects to no more than 3.4 errors per million opportunities.\n\n\nCore principle: Improve quality by removing the causes of errors and minimizing variability.\n\n\nApproach: Uses statistical tools and process analysis to make decisions.\n\n\n\n🛠️ The Six Sigma Methodologies\n✅ \nDMAIC\n (for improving existing processes):\n\n\nDefine – Identify the problem and customer requirements\n\n\nMeasure – Gather data on current performance\n\n\nAnalyze – Find root causes of defects or variation\n\n\nImprove – Implement and verify solutions\n\n\nControl – Sustain improvements through monitoring\n\n\n🚀 \nDMADV\n (for creating new processes/products):\n\n\nDefine\n\n\nMeasure\n\n\nAnalyze\n\n\nDesign\n\n\nVerify\n\n\n\n📊 Tools Used in Six Sigma\n\n\nPareto charts\n\n\nControl charts\n\n\nCause-and-effect diagrams (fishbone/Ishikawa)\n\n\nHistograms\n\n\nRegression analysis\n\n\nProcess capability analysis\nCause and effect\nsixsigmastudyguide.com/cause-effect-diagram-aka-ishikawa-fishbone-herringbone-fishikawa/\nFishbone / Ishikawa\n\n\n"},"Project-Management-Coursera/The-project-life-cycle":{"slug":"Project-Management-Coursera/The-project-life-cycle","filePath":"Project-Management-Coursera/The project life cycle.md","title":"The project life cycle","links":[],"tags":["pm"],"content":"The project life cycle\nInitiate the project\nIn this phase, ask questions to help set the foundation for the project, such as:\n\n\nWho are the stakeholders?\n\n\nWhat are the client’s or customer’s goals?\n\n\nWhat is the purpose and mission of the project?\n\n\nWhat are the measurable objectives for the team?\n\n\nWhen does this project need to be completed? \n\n\nWhat skills and resources will the project require? \n\n\nWhat will the project cost? What are the benefits?\n\n\nMake a plan\nIn this phase, make a plan to get your project from start to finish. \n\nCreate a detailed project plan. What are the major milestones? What tasks or deliverables make up each milestone?  \nBuild out the schedule so you can properly manage the resources, budget, materials, and timeline. Here, you will create an itemized budget.\n\nExecute the project\nIn this phase, put all of your hard work from the first two phases into action.\n\n\nMonitor your project team as they complete project tasks. \n\n\nBreak down any barriers that would slow or stop the team from completing tasks. \n\n\nHelp keep the team aware of schedule and deliverable expectations.\n\n\nAddress weaknesses in your process or examine places where your team may need additional training to meet the project’s goals.\n\n\nAdapt to changes in the project as they arise.\n\n\nClose the project\nIn this phase, close out the project.\n\nIdentify that your team has completed all of the requested outcomes. \nTake time with your team to celebrate your successes!\nPass off all remaining deliverables and get stakeholder approval.\nDocument the lessons you and your team learned during the project.\nReflect on ways to improve in the future.\n\nKey takeaway\nEach phase of the project life cycle has its own significance and reason for existing. By following the project life cycle, you’re ensuring that you are:\n\nCapturing the expectations of your customer\nSetting your project up for success with a plan\nExecuting project tasks and addressing any issues that arise\nClosing out your project to capture any lessons learned\n"},"index":{"slug":"index","filePath":"index.md","title":"index","links":["Project-Management-Coursera/Project-initiation/1.-Key-Components-of-Project-Initiation","Project-Management-Coursera/Project-initiation/2.-SMART-goals","Project-Management-Coursera/Project-initiation/3.-OKR----objectives-and-key-results.","Project-Management-Coursera/Project-initiation/4.-Project-scope"],"tags":["project-management"],"content":"Welcome to my project management notes\nProject initiation\n1. Key Components of Project Initiation\n2. SMART goals\n3. OKR -  objectives and key results.\n4. Project scope"}}